bit-finance/InformationRegisters/бит_НастройкиОбъектовВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиОбъектовВизирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьВизирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОбновленияВиз</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыОбновленияПеречняВиз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимКонтроляВложений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьКУчетуПослеУтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_РежимыОбновленияПеречняВиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыОбновленияПеречняВиз</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбновлятьПриПерепроведении</Name>
					<Comment>Обновлять при перепроведении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбновлять</Name>
					<Comment>Не обновлять</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_ПользовательскиеУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеУсловия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодУсловия</Name>
					<Comment>Код условия на внутреннем языке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстВыполнения</Name>
					<Comment>Контекст выполнения пользовательского условия</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтекстыВыполненияПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Comment>Алгоритм</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПользовательскогоУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыПользовательскихУсловий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкобкаНачало</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкобкаКонец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединениеСПоследующим</Name>
							<Comment>Объединение с последующим</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипыОбъединенияУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Comment>Это выражение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУсловий</Name>
					<Comment>Параметры условий</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД_Условия</Name>
							<Comment>Идентификатор условия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Comment>Вид сравнения</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыСравненияТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Comment>Дополнительные параметры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолеваяАдресация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСписковУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/CommonModules/бит_ВизированиеПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Параметры проверки пользовательского условия.
//
// Параметры:
//  ПользовательскоеУсловие - СправочникСсылка.бит_ПользовательскиеУсловия.
//	ИмяПроверяемогоОбъекта - Строка - Полное имя метаданных проверяемого объекта.
// 
// Возвращаемое значение:
//  Структура - параметры проверки:
//   * КодУсловия - Строка - Код условия пользовательского условия.
//   * УсловиеПодходитТекущемуОбъекту - Булево.
//
Функция ПараметрыПроверкиПользовательскогоУсловия(ПользовательскоеУсловие, ИмяПроверяемогоОбъекта) Экспорт
	
	ПараметрыПроверки = Справочники.бит_ПользовательскиеУсловия.ПараметрыПроверкиСсылкиПользовательскогоУсловия(
																					ПользовательскоеУсловие,
																					ИмяПроверяемогоОбъекта);
	Возврат Новый ФиксированнаяСтруктура(ПараметрыПроверки);
	
КонецФункции

Функция ТипСтатусаОбъкта(Статус) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Статус, "ТипСтатуса");
	
КонецФункции

// Возвращает настройки для объекта визирования из регистра сведений бит_НастройкиОбъектовВизирования.
// 
// Параметры:
//  Объект - ДокументОбъект; СправочникОбъект; ДокументСсылка; СправочникСсылка.
// 
// Возвращаемое значение:
//   Структура
//		* ИспользоватьВизирование - Булево, 
//		* РежимОбновленияВиз      - ПеречислениеСсылка.бит_РежимыОбновленияПеречняВиз.
//
Функция НастройкиОбъектаВизирования(Объект) Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("ИспользоватьВизирование", Ложь);
	Настройки.Вставить("РежимОбновленияВиз",      Перечисления.бит_РежимыОбновленияПеречняВиз.ОбновлятьПриПерепроведении);
	Настройки.Вставить("РежимКонтроляВложений",   Перечисления.бит_ВидыКонтроля.НеКонтролировать);
	Настройки.Вставить("ПриниматьКУчетуПослеУтверждения", Ложь);
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Настройки;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Строка") Тогда
		ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(Объект);
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
		ОбъектСистемы = Объект;
	Иначе
		Возврат Настройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбъектовВизирования.ОбъектСистемы КАК ОбъектСистемы,
	|	НастройкиОбъектовВизирования.ИспользоватьВизирование КАК ИспользоватьВизирование,
	|	ВЫБОР
	|		КОГДА НастройкиОбъектовВизирования.РежимОбновленияВиз = ЗНАЧЕНИЕ(Перечисление.бит_РежимыОбновленияПеречняВиз.ПоУмолчанию)
	|			ТОГДА &РежимОбновленияВизПоУмолчанию
	|		ИНАЧЕ НастройкиОбъектовВизирования.РежимОбновленияВиз
	|	КОНЕЦ КАК РежимОбновленияВиз,
	|	ВЫБОР
	|		КОГДА НастройкиОбъектовВизирования.РежимКонтроляВложений = ЗНАЧЕНИЕ(Перечисление.бит_ВидыКонтроля.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бит_ВидыКонтроля.НеКонтролировать)
	|		ИНАЧЕ НастройкиОбъектовВизирования.РежимКонтроляВложений
	|	КОНЕЦ КАК РежимКонтроляВложений,
	|	НастройкиОбъектовВизирования.ПриниматьКУчетуПослеУтверждения КАК ПриниматьКУчетуПослеУтверждения
	|ИЗ
	|	РегистрСведений.бит_НастройкиОбъектовВизирования КАК НастройкиОбъектовВизирования
	|ГДЕ
	|	НастройкиОбъектовВизирования.ОбъектСистемы = &ОбъектСистемы";
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
	Запрос.УстановитьПараметр("РежимОбновленияВизПоУмолчанию",
								бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РежимОбновленияПеречняВиз"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти
